[
  {
    "year": "May 2022 - Present",
    "title": "Bytedance - Global Payments Team",
    "subtitle": "Fullstack Engineer Intern",
    "body": "● Architected and implemented Elastic Search functionality for an established relational database, decreasing search time by up to 1/4\n● Implemented the Feedback system from the ground up for a Document Management System used by external merchants",
    "color": "green",
    "tags": [
      "React",
      "Arco Design",
      "NodeJS",
      "Koa",
      "Redis",
      "Typescript",
      "MySQL",
      "Modernjs"
    ]
  },
  {
    "year": "July 2022 – Present",
    "title": "Google Developer Student Clubs NUS - Project Juniors Club",
    "subtitle": "Tech Lead",
    "body": "● Spearheading a team of 7 software developers to build a Learning Management System for Food Bank to digitalise their in-person teaching programmes.",
    "tags": [
      "React",
      "Recoiljs",
      "TypeScript",
      "Ant Design",
      "NodeJS",
      "Express",
      "Sequelize",
      "PostgreSQL"
    ]
  },

  {
    "year": "Sep 2021 – July 2022",
    "title": "Google Developer Student Clubs NUS - Project Siew Dai",
    "subtitle": "Fullstack Engineer",
    "url": "https://dsc.comp.nus.edu.sg/our-projects",
    "body": "● Developed a Stakeholder Management System for Diabetes Singapore to digitalise thousands of data entries from their members, volunteers and event participants previously recorded on physical documents.\n● Saved over 4k lines of code by abstracting multiple pages into a single generic component using Typescript generics and union types, improving code readability and maintainability.",
    "tags": [
      "React",
      "Redux",
      "TypeScript",
      "Ant Design",
      "NodeJS",
      "Express",
      "Sequelize",
      "PostgreSQL"
    ]
  },

  {
    "year": "May 2021 – Aug 2021",
    "title": "Computing for Voluntary Welfare Organisations (CVWO)",
    "subtitle": "Fullstack Engineer Intern",
    "url": "https://www.comp.nus.edu.sg/~vwo/projects/2021-cms.html",
    "body": "● Built a Case Management System for Lions Befrienders Cluster Support Programme to track case work previously done manually with Word documents/Excel sheets used by hundreds of Befrienders\n● Migrated frontend for Case Management System for Care Corner from a legacy server-rendered view with Ruby on Rails to a new client-side rendering with React, improving the UX and performance for hundreds of staff",
    "color": "green",
    "tags": ["Redux", "Typescript", "Ruby on Rails", "PostgreSQL", "MySQL"]
  },
  {
    "year": "Oct 2020 – Nov 2020",
    "title": "17th STePS NUS SoC Project Showcase",
    "subtitle": "Student Leader",
    "url": "https://isteps.comp.nus.edu.sg/event/17th-steps",
    "body": "● Led and organised the event comprising of more than 1700 registered guests showcasing 70 innovative projects. \n● Responsible for liaising with various sponsors and ensuring that their requests are met before and during the event."
  }
]
