[
  {
    "year": "May 2022 - Present",
    "title": "Government Technology Agency - Government Digital Services Team",
    "subtitle": "Fullstack Engineer Intern",
    "body": "● Developing GatherSG, a Case Management System to allow users to track and monitor referral and coordinate items, prompt agencies for updates and assess cases collectively in a team of 11 software engineers",
    "color": "green",
    "tags": ["React", "Ant Design",
     "Prisma",
     "NodeJS",
     "Redis",
     "Typescript",
     "JavaScript",
     "MySQL",
     "Docker",
     "AWS"
    ]
  },
  {
    "year": "May 2022 - Mar 2023",
    "title": "Bytedance - Global Payments Team",
    "subtitle": "Fullstack Engineer Intern",
    "body": "• Architected and implemented Elasticsearch functionality for an existing relational database, improving search times by up to 500%\n• Developed an automatic hedging strategy platform to reduce foreign exchange risks faced by the company\n• Implemented permissions centre microservice using Remote Procedure Calls (RPC) unifying two separate permissions systems\n• Spearheaded initiative to increase platform stability with more robust error handling and consistent logging systems, standardising\nerror codes, leading to better developer experience when troubleshooting errors\n• Mentored onboarding junior engineers and performed code review",
    "tags": [
      "React",
      "Arco Design",
      "NodeJS",
      "Koa",
      "Redis",
      "Typescript",
      "MySQL",
      "Modernjs"
    ]
  },
  {
    "year": "July 2022 – Present",
    "title": "Google Developer Student Clubs NUS - Project Juniors Club",
    "subtitle": "Tech Lead",
    "body": "● Spearheading a team of 7 software developers to build a Learning Management System for Food Bank to digitalise their in-person teaching programmes.",
    "tags": [
      "React",
      "Recoiljs",
      "TypeScript",
      "Ant Design",
      "NodeJS",
      "Express",
      "Sequelize",
      "PostgreSQL"
    ]
  },

  {
    "year": "Sep 2021 – July 2022",
    "title": "Google Developer Student Clubs NUS - Project Siew Dai",
    "subtitle": "Fullstack Engineer",
    "url": "https://dsc.comp.nus.edu.sg/our-projects",
    "body": "● Developed a Stakeholder Management System for Diabetes Singapore to digitalise thousands of data entries from their members, volunteers and event participants previously recorded on physical documents.\n● Honoured a plaque by Minister Chan Chun Seng as a commendation for our development efforts.\n● Saved over 4k lines of code by abstracting 7 similar workflows into multiple generic components using Typescript generics and union types, improving code readability and maintainability.",
    "tags": [
      "React",
      "Redux",
      "TypeScript",
      "Ant Design",
      "NodeJS",
      "Express",
      "Sequelize",
      "PostgreSQL"
    ]
  },

  {
    "year": "May 2021 – Aug 2021",
    "title": "Computing for Voluntary Welfare Organisations (CVWO)",
    "subtitle": "Fullstack Engineer Intern",
    "url": "https://www.comp.nus.edu.sg/~vwo/projects/2021-cms.html",
    "body": "● Built a Case Management System for Lions Befrienders Cluster Support Programme to track case work previously done manually with Word documents/Excel sheets used by hundreds of Befrienders\n● Migrated frontend for Case Management System for Care Corner from a legacy server-rendered view with Ruby on Rails to a new client-side rendering with React, improving the UX and performance for hundreds of staff",
    "tags": ["Redux", "Typescript", "Ruby on Rails", "PostgreSQL", "MySQL"]
  },
  {
    "year": "Oct 2020 – Nov 2020",
    "title": "17th STePS NUS SoC Project Showcase",
    "subtitle": "Student Leader",
    "url": "https://isteps.comp.nus.edu.sg/event/17th-steps",
    "body": "● Led and organised the event comprising of more than 1700 registered guests showcasing 70 innovative projects. \n● Responsible for liaising with various sponsors and ensuring that their requests are met before and during the event."
  }
]
